[
	{
		"title": "Portfolio Website",
		"start": "2021",
		"end": "Ongoing",
		"languages": [
			"HTML",
			"CSS",
			"JavaScript"
		],
		"experience": false,
		"project": true,
		"tags": [
			"Web Design",
			"Library Usage"
		],
		"highlights": [
			"Created a consistent, front-end design for a website",
			"Implemented various features into the website, including filtering, mobile view, and more",
			"Utilized open source libraries to effeciently solve problems",
			"Utilized a template library to provide automatic generation of pages provided data without any extra coding necessary"
		],
		"details": [],
		"urls": [
			["https://github.com/TheCrossBoy/Portfolio", "Website Repo", "fab fa-github"],
			["https://github.com/TheCrossBoy/Portfolio/blob/main/data.json", "JSON Data Format"]
		]
	},
	{
		"title": "Triton Gaming",
		"start": "2021",
		"end": "Ongoing",
		"languages": [],
		"experience": true,
		"project": false,
		"tags": [
			"School Club",
			"Event Planning",
			"Leadership",
			"Collaboration",
			"Problem Solving"
		],
		"highlights": [
			"Planned large scale events for the gaming community at UCSD",
			"Created multiple organizational frameworks to allow consistency between events",
			"Led the teams responsible for general logistics and inventory management for multiple events",
			"Created systems to keep track of dozens of pieces of equipment without losing anything",
			"Managed and moderated the community Discord server of 4,500+ members"
		],
		"details": [],
		"urls": [
			["https://discord.gg/tritongaming", "Community Discord", "fab fa-discord"]
		]
	},
	{
		"title": "UC San Diego Computer Science Department",
		"start": "2021",
		"end": "Ongoing",
		"languages": [
			"C++",
			"C"
		],
		"experience": true,
		"project": false,
		"tags": [
			"Teaching",
			"Code Review",
			"Problem Solving"
		],
		"highlights": [
			"Held office hours to assist over 400 students",
			"Worked to help students through theoretical misconceptions, code problems, and general questions",
			"Created resources, such as automatic run debugging, to aid in students' development",
			"Assisted in the course's Discussion section to enhance the learning process",
			"Lead 30+ tutors as Head Tutor my final quarter, guiding new tutors, setting up course logistics, and assisting when odd tasks needed to be completed."
		],
		"details": [
			"Through the years, I tutored for a total of three courses. These were CSE 12: Basic Data Structures and Object Oriented Design, CSE 100: Advanced Data Structures, and CSE 142L: Software Project for Computer Architecture."
		],
		"urls": []
	},
	{
		"title": "Chairiots: A 3D Networked Game in Rust",
		"start": "Spring 2022",
		"languages": [
			"Rust"
		],
		"experience": false,
		"project": true,
		"tags": [
			"Software Engineering",
			"Game Engineering",
			"Game Design",
			"Class Project",
			"Code Review",
			"Collaboration",
			"Problem Solving"
		],
		"highlights": [
			"Created a 3D, real time, 4 player video game in 10 weeks without an engine",
			"Collaborated with others in order to produce a product based on a specification",
			"Learned a new programming language to adapt to the group's decisions",
			"Added additional functionality to our engine to implement desired features into the game",
			"Designed multiple 'racechairs', each with different strengths and weaknesses and game feels"
		],
		"details": [],
		"urls": [
			["https://www.youtube.com/watch?v=iDiPYyJkVA8", "Team Presentation", "fab fa-youtube"],
			["https://chairiots.notion.site/Chairioteers-Web-Page-bf2521783c0a46f7b06b0f072779be0f", "Team Webpage"],
			["https://github.com/ucsd-cse125-sp22/cse125-sp22-group1", "Repo", "fab fa-github"],
			["https://chairiots.notion.site/Final-Report-875046aed50043d1a92e1ed669c81c71", "Final Report", "fas fa-file-alt"]
		]
	},
	
	{
		"title": "AmpliPy: Python Variant Calling",
		"start": "2021",
		"end": "2022",
		"languages": [
			"Python",
			"C++"
		],
		"experience": true,
		"project": true,
		"tags": [
			"Research",
			"Bioinformatics",
			"Code Review",
			"Optimization",
			"Collaboration"
		],
		"highlights": [
			"Researched COVID-19 genomics, and how to track the spread of the disease through a population",
			"Reviewed old code in order to understand its purpose, ineffeciencies, and algorithms",
			"Reimplemented the algorithms in Python in order to eliminate ineffeciencies resulting in a 50% reduction in runtime",
			"Worked with Professors and other students to complete the program and refine an associated paper",			
			"Wrote a paper summarizing the project to capstone it, which can be found below"
		],
		"details": [],
		"urls": [
			["https://docs.google.com/document/d/e/2PACX-1vQL5dSx5b7DACDaawkgQ2wbd5s-KacMN6xKeq_96rsF7bI4_fP--86bqqXgOEHCoze5Rg4DSZRjBuPI/pub", "Finished Paper", "fas fa-file-contract"],
			["https://github.com/Niema-Lab/AmpliPy", "AmpliPy Repo", "fab fa-github"]
		]
	},
	{
		"title": "League of Tritons",
		"start": "2021",
		"end": "2022",
		"languages": [],
		"experience": true,
		"project": false,
		"tags": [
			"School Club",
			"Event Planning",
			"Collaboration"
		],
		"highlights": [
			"Planned events catering towards the League of Legends community at UCSD",
			"Managed virtual events bringing the community together in the game",
			"Managed and moderated the community Discord"
		],
		"details": [],
		"urls": [
			["https://discord.gg/RV8F95h", "Community Discord", "fab fa-discord"]
		]
	},
	{
		"title": "UC San Diego Esports - League of Legends",
		"start": "2021",
		"end": "2022",
		"languages": [],
		"experience": true,
		"project": false,
		"tags": [
			"Live Performance",
			"Game Analysis",
			"School Club",
			"Collaboration"
		],
		"highlights": [
			"Casted for the UCSD Varsity League of Legends collegiate team",
			"Provided Play by Play shotcalling, live analysis of game state, and retroactive insight into plays",
			"Participated in a live environment with others",
			"Stayed calm under pressure and kept up with the high stakes, speedy gameplay",
			"Supported my fellow casters they, and relied on them when I, were in need of assistance"
		],
		"details": [],
		"urls": [
			["https://www.twitch.tv/ucsdesports", "Broadcast Channel", "fab fa-twitch"]
		]
	},
	{
		"title": "Computer Science & Engineering Summer Program for Incoming Students",
		"start": "2021",
		"languages": [
			"Python"
		],
		"experience": true,
		"project": false,
		"tags": [
			"Leadership",
			"Code Review",
			"Problem Solving",
			"Software Engineering"
		],
		"highlights": [
			"Worked as a mentor for the SPIS Program to dozens of students, including four direct mentees",
			"Gave advice, help, and support to students as they adjusted to college life and work for the first time",
			"Assisted with the students' project, giving advice about how best to solve the problems they faced",
			"Worked with students to help them solve the problems they faced as they coded",
			"Interacted with the students in fun activities to keep them engaged in the program and excited to start",
			"Updated and managed a Python Discord bot in order to assist in the day-to-day of the camp"
		],
		"details": [],
		"urls": [
			["http://spis.ucsd.edu/", "SPIS Homepage"],
			["http://spis.ucsd.edu/highlights.html", "Previous Projects", "fas fa-users"]
		]
	},
	{
		"title": "Pomodoro Webapp",
		"start": "2021",
		"languages": [
			"HTML",
			"JavaScript",
			"CSS"
		],
		"experience": false,
		"project": true,
		"tags": [
			"Web Design",
			"Class Project",
			"Collaboration",
			"CI-CD Pipeline",
			"Code Review",
			"Unit Testing"
		],
		"highlights": [
			"Worked with a team to create a project based on a provided specification of a Pomodoro Timer",
			"Created the initial HTML framework and helped with the design decisions of the app",
			"Implemented features into the app with Javascript, including a modular settings menu and sound effects",
			"Participated in weekly reflections, sprints, and planning meetings",
			"Reviewed other students' code and assisted in bug hunting, solving, and advice when they were stuck."
		],
		"details": [],
		"urls": [
			["https://zvidmarb.github.io/cse110-w21-group23/", "Production Site", "fas fa-stopwatch"],
			["https://github.com/zvidmarb/cse110-w21-group23", "Group Repo", "fab fa-github"]
		]
	},
	{
		"title": "Pluto.gg",
		"start": "2019",
		"end": "2021",
		"languages": [
			"Lua",
			"SQL",
			"PHP",
			"HTML",
			"CSS",
			"JavaScript"
		],
		"experience": true,
		"project": false,
		"tags": [
			"Game Design",
			"Game Engineering",
			"Web Design",
			"Garry's Mod",
			"Collaboration"
		],
		"highlights": [
			"Worked as a developer on both the Game and Web sides of the community",
			"Assisted in the ideation phase of various in game events, items, features, and functionality",
			"Implemented compiled ideas into functional game code",
			"Worked on a live, evolving game",
			"Implemented web features, including PayPal donation integration, Discord login, and more",
			"Created and maintained a Discord bot for the community"
		],
		"details": [],
		"urls": [
			["https://github.com/meepen/tttrw", "Gamemode Repo", "fab fa-github"],
			["https://github.com/meepen/pluto-inv", "Pluto Content Repo", "fab fa-github"],
			["https://github.com/pluto-oss/styx", "Discord Bot Repo", "fab fa-github"],
			["https://github.com/pluto-oss/pluto-admin", "Moderation Repo", "fab fa-github"]
		]
	},
	{
		"title": "Pluto.gg TTT",
		"start": "2019",
		"end": "2021",
		"languages": [
			"Lua",
			"SQL"
		],
		"experience": false,
		"project": true,
		"tags": [
			"Game Design",
			"Game Engineering",
			"Full Stack",
			"Garry's Mod"
		],
		"highlights": [
			"Helped with a rewrite of a popular Garry's Mod gamemode Trouble in Terrorist Town",
			"Assisted in the ideation phase of various in game events, items, features, and functionality",
			"Implemented assigned ideas into functional game code",
			"Worked on a live, evolving game product",
			"Implemented systems such as a chatbox with channels, playercards, a scoreboard, and more"
		],
		"details": [],
		"urls": [
			["https://gist.github.com/TheCrossBoy/08a99992c7b58fd09043ebba7f96ab17", "Project Highlights", "fas fa-meteor"],
			["https://github.com/meepen/tttrw", "TTTRW Repo", "fab fa-github"],
			["https://github.com/meepen/pluto-inv", "Pluto Content Repo", "fab fa-github"],
			["https://github.com/pluto-oss/pluto-admin", "Moderation Repo", "fab fa-github"]
		]
	},
	{
		"title": "Pluto.gg Styx Discord Bot",
		"start": "2019",
		"end": "2021",
		"languages": [
			"JavaScript",
			"SQL"
		],
		"experience": false,
		"project": true,
		"tags": [
			"Software Engineering",
			"Library Usage"
		],
		"highlights": [
			"Programmed features on a Discord bot using Discord.js",
			"Maintained the bot and fixed bugs that appeared",
			"Integrated with the forums and game in order to sync things across the three systems"
		],
		"details": [],
		"urls": [
			["https://github.com/pluto-oss/styx", "Styx Repo", "fab fa-github"]
		]
	},
	{
		"title": "Pluto.gg Forums",
		"start": "2019",
		"end": "2021",
		"languages": [
			"PHP",
			"HTML",
			"CSS",
			"SQL",
			"JavaScript"
		],
		"experience": false,
		"project": true,
		"tags": [
			"Web Design",
			"Full Stack",
			"Library Usage"
		],
		"highlights": [
			"Learned about the Invision Community Forum API",
			"Applied the knowledge to create functional front and backend systems for users and administrators",
			"Created a donation interface using PayPal's transaction API, a player information summary page, Discord integration, and more"
		],
		"details": [],
		"urls": [
			["https://gist.github.com/TheCrossBoy/d0324fe45b6b3b1324284120a93ca3f1", "Project Highlights", "fab fa-github"]
		]
	},
	{
		"title": "Robotics Club Programming",
		"start": "2015",
		"end": "2019",
		"languages": [
			"Java"
		],
		"experience": true,
		"project": true,
		"tags": [
			"School Club",
			"Outreach",
			"Leadership",
			"Software Engineering",
			"Library Usage"
		],
		"highlights": [
			"Programmed the Driver Control and Autonomous Motion for our school's FTC Robotics team",
			"Utilized hardware added by other members in code to make it functional",
			"Won multiple awards, including for the hardware and software of the robot, awards at regional competitions",
			"Worked as the Lead Developer for all four years",
			"Led as President of the club during my final year",
			"Influenced design decisions of the overall design of our robot",
			"Kept development logs, made reflections about our codebase, and constructed a notebook that described all the details of our design"
		],
		"details": [],
		"urls": [
			["https://gist.github.com/TheCrossBoy/79a6df9273385a8df069f0775adb547e", "Code Excerpts + Video", "fas fa-meteor"]
		]
	},
	{
		"title": "Exoterra Gaming",
		"start": "2016",
		"end": "2018",
		"languages": [
			"Lua"
		],
		"experience": true,
		"project": false,
		"tags": [
			"Game Design",
			"Game Engineering",
			"Garry's Mod"
		],
		"highlights": [
			"Worked as a developer for the community and its servers",
			"Iterated through various design changes with testers to ensure functional and quality content",
			"Participated in the ideation phase to construct unique ideas for the servers to utilize"
		],
		"details": [
			"This gaming community is where I truly fell in love with game development. The primary developer for the community took me under his wing, allowing me to learn more about programming by working alongside me.",
			"While I started with fairly simple changes, lots of oversight, and limited access to the source code, over time, I was granted full access to the servers and source code, permission to make changes without seeking specific approvals, and even given my own server to make my own. I proved myself trustworthy and invaluable to the community, and worked with them until the community unfortunately shut down.",
			"At its peak, our community's Jailbreak server was the most popular Jailbreak server on Garry's Mod. Even when other competition popped up, we were still consistently able to maintain activity for the majority of the server's lifetime."
		],
		"urls": []
	},
	{
		"title": "Exoterra Jailbreak",
		"start": "2016",
		"end": "2018",
		"languages": [
			"Lua"
		],
		"experience": false,
		"project": true,
		"tags": [
			"Game Design",
			"Game Engineering",
			"Garry's Mod"
		],
		"highlights": [
			"Created new features for an existing codebase on a Jailbreak server",
			"Worked with another developer to update, modernize, and beautify old code to work for our needs",
			"Updated a logs addon to work with Jailbreak",
			"<span class=\"italic\">Note, due to the community shutting down and its age, much of this code and content is lost to time. Selections can be found below, but it is not an all encompassing summary.</span>"
		],
		"details": [],
		"urls": [
			["https://gist.github.com/TheCrossBoy/b08f69f19a58e37b9a4c56c53213e1c1", "Code Highlights", "fas fa-meteor"]
		]
	},
	{
		"title": "Exoterra Deathrun",
		"start": "2016",
		"languages": [
			"Lua"
		],
		"experience": false,
		"project": true,
		"tags": [
			"Game Design",
			"Game Engineering",
			"Garry's Mod"
		],
		"highlights": [
			"Created, managed, and developed for the community's first Deathrun server",
			"Provided exclusive features for the server based on the original gamemode",
			"Added extra functionality, including an experience and leveling system, to the server",
			"<span class=\"italic\">Note, due to the community shutting down and its age, much of this code and content is lost to time. Selections can be found below, but it is not an all encompassing summary.</span>"
		],
		"details": [],
		"urls": [
			["https://gist.github.com/TheCrossBoy/8da35bba119a223cb5fdfdfe48bd68e6", "Code Highlights", "fas fa-meteor"]
		]
	},
	{
		"title": "National Honor Society / Key Club",
		"start": "2016",
		"end": "2019",
		"languages": [],
		"experience": true,
		"project": false,
		"tags": [
			"Outreach",
			"Leadership",
			"School Club"
		],
		"highlights": [
			"Led as the NHS President and Key Club Vice President during my final year",
			"Managed a team of 60+ students to identify, plan, and implement volunteer projects",
			"Organized and managed 20+ volunteer events our members could attend",
			"Tracked our members' attendance throughout the year to ensure everyone was on track to meet their membership requirements"
		],
		"details": [
			"I volunteered for these groups for as long as I was able to - a total of 2.5 years for NHS, and roughly 4 for Key Club. Throughout my tenure, I participated in numerous volunteering activities in an effort to give back to my community.", 
			"In my senior year, I wanted to step up and lead the clubs that I had participated in for such a long time. I was elected president in NHS, and Vice-President in Key Club. In these positions, I came up with ideas for new volunteering events, rekindled relationships with existing partners, and conducted administrative tasks for the clubs.",
			"In particular, while President of NHS, I created a specialized spreadsheet to track the event completions and hours of work done by each member. Our club had a specific hour requirement for members, and previously, the teacher advisor had to keep track of them on paper, causing students who weren't sure exactly how many hours they had to have to ask her, and creating a large area of possible data loss. With the spreadsheet, I made it as easy as possible for anyone to enter in the data, created a view into the data for students to track their progress, and made it easy for the teacher advisor to monitor the students' progress to completing all requirements."
		],
		"urls": []
	},
	{
		"title": "Sound Engineer",
		"start": "2016",
		"end": "2019",
		"languages": [],
		"experience": true,
		"project": false,
		"tags": [
			"Live Performance",
			"Collaboration"
		],
		"highlights": [
			"Worked on live performances and educational talks to ensure sound quality and audibility throughout the space",
			"Responsible for stage setup, performance, and teardown",
			"Remained focused in the high pressure, live environment"
		],
		"details": [
			"Being someone who was in love with technology, I jumped at the opportunity to volunteer with the sound systems that my school used for weeklky events. As one of the  'sound engineers', I ensured that the performers on stage were always able to be heard throughout the space. This required me learning about sound mixing, multiple pieces of new hardware/technology I had never used before, and solve problems as they came up. I was able to flourish in this environment, and continued doing it until I graduated."
		],
		"urls": []
	}
]
